In [ ]:
import numpy as np
import pandas as pd

In [ ]:
## Use Pandas Series and Pandas DataFrame
### Create Series from Numpy array
arr = np.array([10,20,30,40,50])
print(arr)
print(type(arr))

[10 20 30 40 50]
<class 'numpy.ndarray'>

In [ ]:
pd_Se1 = pd.Series(arr)
print(pd_Se1)
print(type(pd_Se1))

0    10
1    20
2    30
3    40
4    50
dtype: int32
<class 'pandas.core.series.Series'>

In [ ]:
#Crate Pandas Series Using List
list1 = [10,20,30,40,50]
print(list1)
print(type(list1))

[10, 20, 30, 40, 50]
<class 'list'>

In [ ]:
pd_Se1 = pd.Series(list1)
print(pd_Se1)
print(type(pd_Se1))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
pd_Se1 = pd.Series([100,200,300,400,500])
print(pd_Se1)
print(type(pd_Se1))

0    100
1    200
2    300
3    400
4    500
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
#### Create a Series with index a,b,c ....
pd_Se2 = pd.Series(list1,index=['a','b','c','d','e'])
print(pd_Se2)
print(type(pd_Se2))

a    10
b    20
c    30
d    40
e    50
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
#### Create a Series with index a,b,c ....
pd_Se3 = pd.Series(list1,index=['a','b','c'])
print(pd_Se3)
print(type(pd_Se3))

ValueError: Length of values (5) does not match length of index (3)

In [ ]:
#### Create a Series of Characters
char_Series = pd.Series(['a','b','af '])
print(char_Series)

0      a
1      b
2    af
dtype: object

In [ ]:
### Creating a series from dictionary
dic_ = {
    "Name": "Raj",
    "Age":28,
    "Designation":"SE",
    "Office":"Whipro",
    "EmpId":4172,
    "Location":"Hydrabad"
}

In [ ]:
S3= pd.Series(dic_)

In [ ]:
S3

Name                Raj
Age                  28
Designation          SE
Office           Whipro
EmpId              4172
Location       Hydrabad
dtype: object

In [ ]:
### Create a Series of Date..
date_Series = pd.date_range(start='11-09-2023',end='12-12-2023')

In [ ]:
date_Series

DatetimeIndex(['2023-11-09', '2023-11-10', '2023-11-11', '2023-11-12',
               '2023-11-13', '2023-11-14', '2023-11-15', '2023-11-16',
               '2023-11-17', '2023-11-18', '2023-11-19', '2023-11-20',
               '2023-11-21', '2023-11-22', '2023-11-23', '2023-11-24',
               '2023-11-25', '2023-11-26', '2023-11-27', '2023-11-28',
               '2023-11-29', '2023-11-30', '2023-12-01', '2023-12-02',
               '2023-12-03', '2023-12-04', '2023-12-05', '2023-12-06',
               '2023-12-07', '2023-12-08', '2023-12-09', '2023-12-10',
               '2023-12-11', '2023-12-12'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
### indexing Series
Series1 = pd.Series([235,568,78,9666,74586,45789556])

In [ ]:
Series1

0         235
1         568
2          78
3        9666
4       74586
5    45789556
dtype: int64

In [ ]:
#### Access the data 45789556
Series1[5]

45789556

In [ ]:
### access the data from index 3 to end
Series1[3:]

3        9666
4       74586
5    45789556
dtype: int64

In [ ]:
### access the data from start to 9666
Series1[:4]

0     235
1     568
2      78
3    9666
dtype: int64

In [ ]:
#### access the 2nd element and 4th element at a time

In [ ]:
Series1[1::2]

1         568
3        9666
5    45789556
dtype: int64

In [ ]:
Series1[0:4:2]

0    235
2     78
dtype: int64

In [ ]:
Series1

0         235
1         568
2          78
3        9666
4       74586
5    45789556
dtype: int64

In [ ]:
#235,74586,45789556
Series1[[0,4,5]]

0         235
4       74586
5    45789556
dtype: int64

In [ ]:
##### Data Frame
df = pd.DataFrame()
print(df)
print(type(df))

Empty DataFrame
Columns: []
Index: []
<class 'pandas.core.frame.DataFrame'>

In [ ]:
#### Data Frame With Dictionary
## create a df with dict
d1 = {'Name':['Tom','Rock','Steve','Ricks'],'Age':[28,24,32,36]}

In [ ]:
df1 = pd.DataFrame(d1)

In [ ]:
df1

    Name  Age
0    Tom   28
1   Rock   24
2  Steve   32
3  Ricks   36

In [ ]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
d1 = {'Name':['Tom','Rock','Steve','Ricks'],'Age':[28,24,32,36],'Gender':['Male','Female','Female','Male']}

In [ ]:
df2 = pd.DataFrame(d1)

In [ ]:
df2

    Name  Age  Gender
0    Tom   28    Male
1   Rock   24  Female
2  Steve   32  Female
3  Ricks   36    Male

In [ ]:
#### index I1,I2,I3,I4

In [ ]:
df3 = pd.DataFrame(d1,index=['I1','I2','I3','I4'])

In [ ]:
df3

     Name  Age  Gender
I1    Tom   28    Male
I2   Rock   24  Female
I3  Steve   32  Female
I4  Ricks   36    Male

In [ ]:
d3 = {'Col1':['Item1','Item2','Item3','Item4'],'Col2':['Gold','Bronze','Gold','Silver'],
      'Col3':[1.0,2.0,3.0,4.0]}
df3 = pd.DataFrame(d3)
print(df3)

    Col1    Col2  Col3
0  Item1    Gold   1.0
1  Item2  Bronze   2.0
2  Item3    Gold   3.0
3  Item4  Silver   4.0

In [ ]:
dic_2 = {
    "col1": ['Item1','Item2','Item3','Item4'],
    "col2": ['Gold','Bronze','Gold','Gold'],
    "col3":[1.0,2.0,2.0,4.0]
}
df = pd.DataFrame(dic_2)

In [ ]:
df

    col1    col2  col3
0  Item1    Gold   1.0
1  Item2  Bronze   2.0
2  Item3    Gold   2.0
3  Item4    Gold   4.0

In [ ]:
### Create a Data Frame Using Tuple

In [ ]:
list_of_tup = [
        ('1/1/2019',12,6,'Rain'),
        ('2/1/2019',11,7,'Fog'),
        ('3/1/2019',12,8,'Sunny'),
        ('4/1/2019',8,5,'Snow'),
        ('5/1/2019',9,6,'Rain')
       ]

In [ ]:
df = pd.DataFrame(list_of_tup)

In [ ]:
df

          0   1  2      3
0  1/1/2019  12  6   Rain
1  2/1/2019  11  7    Fog
2  3/1/2019  12  8  Sunny
3  4/1/2019   8  5   Snow
4  5/1/2019   9  6   Rain

In [ ]:
df = pd.DataFrame(list_of_tup,columns =['Date','Temp','Wind Speed','Climate'])

In [ ]:
df

       Date  Temp  Wind Speed Climate
0  1/1/2019    12           6    Rain
1  2/1/2019    11           7     Fog
2  3/1/2019    12           8   Sunny
3  4/1/2019     8           5    Snow
4  5/1/2019     9           6    Rain

In [ ]:
dic_2 = {
    "Name": pd.Series(['Tom','Rick','Steve','Tony','Nick']),
    "Age": pd.Series([28,32,24,25,29]),
    "Gender": pd.Series(['Male','Female','Male','Male','Female']),
    "Rating": pd.Series([4.0,5.0,2.0,3.0,3.5])
}
df = pd.DataFrame(dic_2)
print(df)

    Name  Age  Gender  Rating
0    Tom   28    Male     4.0
1   Rick   32  Female     5.0
2  Steve   24    Male     2.0
3   Tony   25    Male     3.0
4   Nick   29  Female     3.5

In [ ]:
dic3={
    "name":pd.Series(["tom","jack","tony","alice","jenny"]),
    "age":pd.Series([28,32,29,25,26]),
    "gender":pd.Series(["m","m","m","f","f"]),
    "rating":pd.Series([4.0,5.,2.,3.,3.5])
}
df=pd.DataFrame(dic3)
df

    name  age gender  rating
0    tom   28      m     4.0
1   jack   32      m     5.0
2   tony   29      m     2.0
3  alice   25      f     3.0
4  jenny   26      f     3.5

In [ ]:
d1 = {'Name': pd.Series(['Tom','Rick','Steve','Tony','Nick']),'Age':pd.Series([28,32,29,25,29]),'Gender':pd.Series(['Male','Female','Male','Female']),'Rating':pd.Series([4.0,5.0,2.0,3.0,3.5])
     }
df5 = pd.DataFrame(d1)

In [ ]:
df5

    Name  Age  Gender  Rating
0    Tom   28    Male     4.0
1   Rick   32  Female     5.0
2  Steve   29    Male     2.0
3   Tony   25  Female     3.0
4   Nick   29     NaN     3.5

In [ ]:
###Basic Functionality
df5.columns

Index(['Name', 'Age', 'Gender', 'Rating'], dtype='object')

In [ ]:
#### transpose
df.T

          0     1     2      3      4
name    tom  jack  tony  alice  jenny
age      28    32    29     25     26
gender    m     m     m      f      f
rating  4.0   5.0   2.0    3.0    3.5

In [ ]:
### data types
df5.dtypes

Name       object
Age         int64
Gender     object
Rating    float64
dtype: object

In [ ]:
df5

    Name  Age  Gender  Rating
0    Tom   28    Male     4.0
1   Rick   32  Female     5.0
2  Steve   29    Male     2.0
3   Tony   25  Female     3.0
4   Nick   29     NaN     3.5

In [ ]:
df5.shape

(5, 4)

In [ ]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Gender  4 non-null      object
 3   Rating  5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 288.0+ bytes

In [ ]:
df5.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Name', 'Age', 'Gender', 'Rating'], dtype='object')]

In [ ]:
df5.values

array([['Tom', 28, 'Male', 4.0],
       ['Rick', 32, 'Female', 5.0],
       ['Steve', 29, 'Male', 2.0],
       ['Tony', 25, 'Female', 3.0],
       ['Nick', 29, nan, 3.5]], dtype=object)

In [ ]:
##### Reading First 5 rows
df5.head()

    Name  Age  Gender  Rating
0    Tom   28    Male     4.0
1   Rick   32  Female     5.0
2  Steve   29    Male     2.0
3   Tony   25  Female     3.0
4   Nick   29     NaN     3.5

In [ ]:
df5.head(2)

   Name  Age  Gender  Rating
0   Tom   28    Male     4.0
1  Rick   32  Female     5.0

In [ ]:
df5.head(1)

  Name  Age Gender  Rating
0  Tom   28   Male     4.0

In [ ]:
### to get last rows
df5.tail()

    Name  Age  Gender  Rating
0    Tom   28    Male     4.0
1   Rick   32  Female     5.0
2  Steve   29    Male     2.0
3   Tony   25  Female     3.0
4   Nick   29     NaN     3.5

In [ ]:
df5.tail(2)

   Name  Age  Gender  Rating
3  Tony   25  Female     3.0
4  Nick   29     NaN     3.5

In [ ]:
df5.tail(1)

   Name  Age Gender  Rating
4  Nick   29    NaN     3.5

In [ ]:
df5.sum()

C:\Users\pc\AppData\Local\Temp\ipykernel_8548\2145574871.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df5.sum()

Name      TomRickSteveTonyNick
Age                        143
Rating                    17.5
dtype: object

In [ ]:
df.sum()

name      tomjacktonyalicejenny
age                         140
gender                    mmmff
rating                     17.5
dtype: object

In [ ]:
df5.mean()

C:\Users\pc\AppData\Local\Temp\ipykernel_8548\1640132065.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df5.mean()

Age       28.6
Rating     3.5
dtype: float64

In [ ]:
df5

    Name  Age  Gender  Rating
0    Tom   28    Male     4.0
1   Rick   32  Female     5.0
2  Steve   29    Male     2.0
3   Tony   25  Female     3.0
4   Nick   29     NaN     3.5

In [ ]:
df5.Name

0      Tom
1     Rick
2    Steve
3     Tony
4     Nick
Name: Name, dtype: object

In [ ]:
df5['Name']

0      Tom
1     Rick
2    Steve
3     Tony
4     Nick
Name: Name, dtype: object

In [ ]:
df5['Age']

0    28
1    32
2    29
3    25
4    29
Name: Age, dtype: int64

In [ ]:
df5['Rating']

0    4.0
1    5.0
2    2.0
3    3.0
4    3.5
Name: Rating, dtype: float64

In [ ]:
df5['Age'].mean()

28.6

In [ ]:
df5['Rating'].mean()

3.5

In [ ]:
## median ### std ### Var
df5['Rating'].std()

1.118033988749895

In [ ]:
df5['Rating'].median()

3.5

In [ ]:
df5['Rating'].var()

1.25

In [ ]:
df5['Age'].var()

6.3

In [ ]:
d1 = {
    'Name':pd.Series(['Steve','Rock','John','Tom','Jack','Rick','Allen']),
    'Age':pd.Series([25,28,26,29,32,34,36]),
    'Gender':pd.Series(['Male','Male','Female','Male','Female','Female','Male']),
    'Dependencies':pd.Series([0,1,4,5,2,3,2]),
    'Income':pd.Series([100000,75000,60000,50000,80000,95000,55000]),
    'Co-Applicant':pd.Series(['Yes','No','No','Yes','No','Yes','yes']),
    'Co-ApplicantIncome':pd.Series([40000,60000,70000,55000,75000,80000,np.NAN])
}

In [ ]:
df=pd.DataFrame(d1)

In [ ]:
df

    Name  Age  Gender  Dependencies  Income Co-Applicant  Co-ApplicantIncome
0  Steve   25    Male             0  100000          Yes             40000.0
1   Rock   28    Male             1   75000           No             60000.0
2   John   26  Female             4   60000           No             70000.0
3    Tom   29    Male             5   50000          Yes             55000.0
4   Jack   32  Female             2   80000           No             75000.0
5   Rick   34  Female             3   95000          Yes             80000.0
6  Allen   36    Male             2   55000          yes                 NaN

In [ ]:
df.to_csv('Loan_Data.csv',index=False)

In [ ]:
df.to_csv('Loan_Data1.csv')

In [ ]:
df2 = pd.read_csv('Loan_Data1.csv')

In [ ]:
df2

,Unnamed: 0,Name,Age,Gender,Dependencies,Income,Co-Applicant,Co-ApplicantIncome
0,0,Steve,25,Male,0,100000,Yes,40000.0
1,1,Rock,28,Male,1,75000,No,60000.0
2,2,John,26,Female,4,60000,No,70000.0
3,3,Tom,29,Male,5,50000,Yes,55000.0
4,4,Jack,32,Female,2,80000,No,75000.0
5,5,Rick,34,Female,3,95000,Yes,80000.0
6,6,Allen,36,Male,2,55000,yes,NaN

In [ ]:
df1

    Name  Age  Gender  Dependencies  Income Co-Applicant  Co-ApplicantIncome
0  Steve   25    Male             0  100000          Yes             40000.0
1   Rock   28    Male             1   75000           No             60000.0
2   John   26  Female             4   60000           No             70000.0
3    Tom   29    Male             5   50000          Yes             55000.0
4   Jack   32  Female             2   80000           No             75000.0
5   Rick   34  Female             3   95000          Yes             80000.0
6  Allen   36    Male             2   55000          yes                 NaN